Диплом/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПланированиеОтпусков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	СтрокаОтпуска = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала) И ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
	
		СтрокаОтпуска.КоличествоДнейОтпуска = (НачалоДня(СтрокаОтпуска.ДатаОкончания) - НачалоДня(СтрокаОтпуска.ДатаНачала)) / (24*360);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	СтрокаОтпуска = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала) И ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
	
		СтрокаОтпуска.КоличествоДнейОтпуска = (НачалоДня(СтрокаОтпуска.ДатаОкончания) - НачалоДня(СтрокаОтпуска.ДатаНачала)) / (24*3600);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика",ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	ТаблДанных = Объект.ОтпускаСотрудников.Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(ТаблДанных, УникальныйИдентификатор);  
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти
